; domain
(define (domain blocksworld)
    (:requirements :strips :typing)
    (:types block robot)
    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty ?x - robot)
        (handfull ?x - robot)
        (holding ?x - block)
    )
    (:action pick-up
        :parameters (?x - block ?robot - robot)
        :precondition (and
            (clear ?x) 
            (ontable ?x) 
            (handempty ?robot)
        )
        :effect (and
            (not (ontable ?x))
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (holding ?x)
        )
    )
    (:action put-down
        :parameters (?x - block ?robot - robot)
        :precondition (and 
            (holding ?x)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (ontable ?x))
        )
    (:action stack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (holding ?x) 
            (clear ?y)
            (handfull ?robot)
        )
        :effect (and 
            (not (holding ?x))
            (not (clear ?y))
            (clear ?x)
            (handempty ?robot)
            (not (handfull ?robot))
            (on ?x ?y)
        )
    )
    (:action unstack
        :parameters (?x - block ?y - block ?robot - robot)
        :precondition (and
            (on ?x ?y)
            (clear ?x)
            (handempty ?robot)
        )
        :effect (and 
            (holding ?x)
            (clear ?y)
            (not (clear ?x))
            (not (handempty ?robot))
            (handfull ?robot)
            (not (on ?x ?y))
        )
    )
)

; problem
(define (problem blocksworld1)
    (:domain blocksworld)
    (:objects
        green_block - block
        yellow_block - block
        red_block - block
        pink_block - block
        purple_block - block
        orange_block - block
        robot - robot
    )
    (:init
        (ontable green_block)
        (ontable purple_block)
        (ontable orange_block)
        (on yellow_block pink_block)
        (on pink_block green_block)
        (on red_block purple_block)
        (clear yellow_block)
        (clear red_block)
        (clear orange_block)
        (handempty robot)
    )
    (:goal (and 
        (on yellow_block pink_block)
        (on pink_block green_block)
        (on green_block red_block)
        (on red_block purple_block)
        (on purple_block orange_block)
    ))
)

; plan
1. (unstack yellow_block pink_block robot)
   deleted: (clear yellow_block) (handempty robot) (on yellow_block pink_block)
   added: (holding yellow_block) (clear pink_block) (handfull robot)
   goals met: 2 of 5
2. (put-down yellow_block robot)
   deleted: (holding yellow_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (ontable yellow_block)
   goals met: 2 of 5
3. (unstack pink_block green_block robot)
   deleted: (clear pink_block) (handempty robot) (on pink_block green_block)
   added: (holding pink_block) (clear green_block) (handfull robot)
   goals met: 1 of 5
4. (put-down pink_block robot)
   deleted: (holding pink_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (ontable pink_block)
   goals met: 1 of 5
5. (unstack red_block purple_block robot)
   deleted: (clear red_block) (handempty robot) (on red_block purple_block)
   added: (holding red_block) (clear purple_block) (handfull robot)
   goals met: 0 of 5
6. (put-down red_block robot)
   deleted: (holding red_block) (handfull robot)
   added: (clear red_block) (handempty robot) (ontable red_block)
   goals met: 0 of 5
7. (pick-up purple_block robot)
   deleted: (ontable purple_block) (clear purple_block) (handempty robot)
   added: (handfull robot) (holding purple_block)
   goals met: 0 of 5
8. (stack purple_block orange_block robot)
   deleted: (holding purple_block) (clear orange_block) (handfull robot)
   added: (clear purple_block) (handempty robot) (on purple_block orange_block)
   goals met: 1 of 5
9. (pick-up red_block robot)
   deleted: (ontable red_block) (clear red_block) (handempty robot)
   added: (handfull robot) (holding red_block)
   goals met: 1 of 5
10. (stack red_block purple_block robot)
   deleted: (holding red_block) (clear purple_block) (handfull robot)
   added: (clear red_block) (handempty robot) (on red_block purple_block)
   goals met: 2 of 5
11. (pick-up green_block robot)
   deleted: (ontable green_block) (clear green_block) (handempty robot)
   added: (handfull robot) (holding green_block)
   goals met: 2 of 5
12. (stack green_block red_block robot)
   deleted: (holding green_block) (clear red_block) (handfull robot)
   added: (clear green_block) (handempty robot) (on green_block red_block)
   goals met: 3 of 5
13. (pick-up pink_block robot)
   deleted: (ontable pink_block) (clear pink_block) (handempty robot)
   added: (handfull robot) (holding pink_block)
   goals met: 3 of 5
14. (stack pink_block green_block robot)
   deleted: (holding pink_block) (clear green_block) (handfull robot)
   added: (clear pink_block) (handempty robot) (on pink_block green_block)
   goals met: 4 of 5
15. (pick-up yellow_block robot)
   deleted: (ontable yellow_block) (clear yellow_block) (handempty robot)
   added: (handfull robot) (holding yellow_block)
   goals met: 4 of 5
16. (stack yellow_block pink_block robot)
   deleted: (holding yellow_block) (clear pink_block) (handfull robot)
   added: (clear yellow_block) (handempty robot) (on yellow_block pink_block)
   goals met: 5 of 5
